Repository: MetaMask/snaps-directory
Catalog: src/locales/*/messages.po
Languages: de_de, ja_jp, pt_br, ru_ru, tr_tr

source: Permissions by <0>{0}</0>
de_de: Berechtigungen von <0>{0}</0>
ja_jp: <0>{0}</0>による許可
pt_br: Permissões por <0>{0}</0>
ru_ru: Разрешения предоставлены <0>{0}</0>
tr_tr: <0>{0}</0> izinleri

source: Privacy Policy
de_de: Datenschutzerklärung
ja_jp: プライバシー ポリシー
pt_br: Política de Privacidade
ru_ru: Политика конфиденциальности
tr_tr: Gizlilik Politikası

source: Provide domain and address lookups
de_de: Domain- und Adressabfragen bereitstellen
ja_jp: ドメインとアドレスの検索を提供
pt_br: Oferecer consultas de domínios e endereços
ru_ru: Выдаёт результаты поиска домена и адреса
tr_tr: Alan ve adres aramalarını sunun

source: Question
de_de: Frage
ja_jp: 質問
pt_br: Pergunta
ru_ru: Вопрос
tr_tr: Soru

source: Related Snaps
de_de: Zugehörige Snaps
ja_jp: 関連Snap
pt_br: Snaps relacionados
ru_ru: Связанные Snaps
tr_tr: İlgili Snap'ler

source: Results for "{searchQuery}"
de_de: Ergebnisse für „{searchQuery}“
ja_jp: "{searchQuery}"の結果
pt_br: Resultados para "{searchQuery}"
ru_ru: Результаты для "{searchQuery}"
tr_tr: "{searchQuery}" için sonuçlar

source: Schedule and execute periodic actions
de_de: Regelmäßige Aktionen planen und ausführen
ja_jp: 定期的なアクションのスケジュール設定と実行
pt_br: Agendar e executar ações periódicas
ru_ru: Планируйте и выполняйте периодические действия
tr_tr: Periyodik eylemleri planla ve gerçekleştir

source: Search
de_de: Suche
ja_jp: 検索
pt_br: Pesquisar
ru_ru: Поиск
tr_tr: Ara

source: Search Snaps
de_de: Snaps suchen
ja_jp: Snapの検索
pt_br: Pesquisar Snaps
ru_ru: Поиск Snaps
tr_tr: Snap'leri Ara

source: Security
de_de: Sicherheit
ja_jp: セキュリティ
pt_br: Segurança
ru_ru: Безопасность
tr_tr: Güvenlik

source: Security key
de_de: Sicherheitsschlüssel
ja_jp: セキュリティキー
pt_br: Chave de segurança
ru_ru: Ключ безопасности
tr_tr: Güvenlik anahtarı

source: Security search
de_de: Sicherheitssuche
ja_jp: セキュリティ検索
pt_br: Pesquisa de segurança
ru_ru: Безопасный поиск
tr_tr: Güvenlik araması

source: See address, account balance, activity and suggest transactions to approve
de_de: Sehen Sie Adresse, Kontostand, Aktivitäten und schlagen Sie Transaktionen zur Genehmigung vor.
ja_jp: アドレス、アカウント残高、アクティビティを表示して、承認するトランザクションを提案
pt_br: Ver endereço, saldo de conta, atividade e sugerir transações para aprovar
ru_ru: Просматривайте адрес, баланс счета, активность и рекомендуйте транзакции для одобрения
tr_tr: Adrese, hesap bakiyesine, aktiviteye bakın ve işlemleri başlatın

source: See All
de_de: Alle ansehen
ja_jp: すべて表示
pt_br: Ver tudo
ru_ru: Смотреть все
tr_tr: Tümünü gör

source: See all results
de_de: Alle Ergebnisse ansehen
ja_jp: すべての結果を表示
pt_br: Ver todos os resultados
ru_ru: Смотреть все результаты
tr_tr: Tüm sonuçları gör

source: See Details
de_de: Details ansehen
ja_jp: 詳細を表示
pt_br: Ver detalhes
ru_ru: Смотреть подробности
tr_tr: Ayrıntıları gör

source: See everything
de_de: Alles sehen
ja_jp: すべて表示
pt_br: Ver tudo
ru_ru: Смотреть все
tr_tr: Her şeyi gör

source: See Latest
de_de: Neueste sehen
ja_jp: 最新のものを表示
pt_br: Ver mais recentes
ru_ru: Смотреть новейшие
tr_tr: En Yenileri gör

source: See the origins of websites that suggest transactions
de_de: Die Ursprünge von Websites, die Transaktionen vorschlagen, ansehen
ja_jp: トランザクションを提案するWebサイトの出所を表示
pt_br: Veja as origens dos sites que sugerem transações
ru_ru: Смотреть происхождение сайтов, которые предлагают транзакции
tr_tr: İşlem öneren web sitelerinin kökenlerini gör

source: Show notifications
de_de: Benachrichtigungen anzeigen
ja_jp: 通知を表示
pt_br: Exibir notificações
ru_ru: Показать уведомления
tr_tr: Bildirimleri göster

source: Sort
de_de: Sortieren
ja_jp: 並べ替え
pt_br: Classificar
ru_ru: Сортировать
tr_tr: Sırala

source: Source Code
de_de: Quellcode
ja_jp: ソースコード
pt_br: Código-fonte
ru_ru: Исходный код
tr_tr: Kaynak Kodu

source: Speedometer
de_de: Tachometer
pt_br: Velocímetro
ru_ru: Спидометр
tr_tr: Hızölçer

source: Start exploring blockchain applications in seconds. Trusted by over 30 million users worldwide.
de_de: Erkunden Sie Blockchain-Anwendungen in Sekundenschnelle. Mehr als 30 Millionen Nutzer weltweit vertrauen darauf.
ja_jp: ブロックチェーンアプリケーションをすぐに始められます。世界中の3千万人以上のユーザーが使用。
pt_br: Comece a explorar aplicativos da blockchain em segundos. Aprovada por mais de 30 milhões de usuários no mundo todo.
ru_ru: Начните изучать приложения блокчейна за считанные секунды. Нам доверяют более 30 миллионов пользователей по всему миру.
tr_tr: Saniyeler içinde blok zincir uygulamalarını keşfetmeye başlayın. Dünya çapında 30 milyonu aşkın kullanıcı güveniyor.

source: Stay in the know with notifications and chat directly in MetaMask.
de_de: Bleiben Sie mit Benachrichtigungen und Chat direkt in MetaMask auf dem Laufenden.
ja_jp: 通知で最新情報を取得し、MetaMaskで直接チャット。
pt_br: Fique por dentro com notificações e converse diretamente na MetaMask.
ru_ru: Будьте в курсе событий с помощью уведомлений и напрямую общайтесь в чате с представителями MetaMask.
tr_tr: Bildirimlerle güncel kalın ve doğrudan MetaMask'te sohbet edin.

source: Store and manage its data on your device
de_de: Speichern und verwalten Sie die Daten auf Ihrem Gerät
ja_jp: デバイスでデータを保存・管理
pt_br: Armazene e gerencie seus dados em seu dispositivo
ru_ru: Храните его данные на своем устройстве и управляйте ими
tr_tr: Verilerini cihazınızda saklayın ve yönetin

source: Support
ja_jp: サポート
pt_br: Suporte
ru_ru: Поддержка
tr_tr: Destek

source: Support for WebAssembly
de_de: Support für WebAssembly
ja_jp: WebAssemblyのサポート
pt_br: Suporte do WebAssembly
ru_ru: Поддержка WebAssembly
tr_tr: WebAssembly desteği

source: Tag
ja_jp: タグ
ru_ru: Тег
tr_tr: Etiket

source: Terms of Use
de_de: Nutzungsbedingungen
ja_jp: 利用規約
pt_br: Termos de Uso
ru_ru: Условия использования
tr_tr: Kullanım Şartları

source: The page you're looking for can't be found.
de_de: Die Seite, die Sie suchen, kann nicht gefunden werden.
ja_jp: お探しのページが見つかりません。
pt_br: A página que você procura não foi encontrada.
ru_ru: Не удается найти страницу, котрую вы ищете.
tr_tr: Aradığınız sayfa bulunamıyor.

source: Timer
ja_jp: タイマー
pt_br: Temporizador
ru_ru: Таймер
tr_tr: Zamanlayıcı

source: To use MetaMask Snaps, you need the extension in your browser.
de_de: Um MetaMask Snaps zu verwenden, benötigen Sie die Erweiterung in Ihrem Browser.
ja_jp: MetaMask Snapsを使用するには、ブラウザに拡張機能が必要です。
pt_br: Para usar o MetaMask Snaps, você precisa da extensão em seu navegador.
ru_ru: Для использования MetaMask Snaps вам нужно расширение в вашем браузере.
tr_tr: MetaMask Snaps'i kullanmak için tarayıcınızda uzantı olması gereklidir.

source: To use MetaMask Snaps, you need the latest version (11.0) of MetaMask in your browser. <0>Learn more.</0>
de_de: Um MetaMask Snaps zu verwenden, benötigen Sie die neueste Version (11.0) von MetaMask in Ihrem Browser. <0>Erfahren Sie mehr.</0>
ja_jp: MetaMask Snapsを使用するには、ブラウザに最新バージョン (11.0) のMetaMaskが必要です。<0>詳細はこちら。</0>
pt_br: Para usar o MetaMask Snaps, você precisa da versão mais recente (11.0) da MetaMask em seu navegador. <0>Saiba mais.</0>
ru_ru: Для использования MetaMask Snaps вам нужна последняя версия MetaMask (11.0) в вашем браузере. <0>Подробнее.</0>
tr_tr: MetaMask Snaps'i kullanmak için tarayıcınızda en yeni MetaMask sürümüne (11.0) ihtiyacınız vardır. <0>Daha fazla bilgi alın.</0>

source: Toggle color mode
de_de: Farbmodus umschalten
ja_jp: カラーモードを切り替える
pt_br: Alternar modo colorido
ru_ru: Сменить цветовой режим
tr_tr: Renk modunu değiştir

source: Unread notification
de_de: Ungelesene Benachrichtigung
ja_jp: 未読の通知
pt_br: Notificação não lida
ru_ru: Непрочитанное уведомление
tr_tr: Okunmamış bildirim

source: Update required
de_de: Update erforderlich
ja_jp: アップデートが必要です
pt_br: Atualização necessária
ru_ru: Требуется обновление
tr_tr: Güncelleme gerekli

source: Update Snap
de_de: Snap aktualisieren
ja_jp: Snapのアップデート
pt_br: Atualizar Snap
ru_ru: Обновить Snap
tr_tr: Snap'i güncelle

source: Updates for your installed Snaps will be displayed here when available.
de_de: Updates für Ihre installierten Snaps werden hier angezeigt, sobald sie verfügbar sind.
ja_jp: インストールされたSnapのアップデートが利用可能な場合、ここに表示されます。
pt_br: As atualizações dos seus Snaps instalados serão exibidas aqui quando disponíveis.
ru_ru: Здесь будут отображаться обновления для установленных Snaps, если они доступны.
tr_tr: Yüklü Snap'leriniz için güncellemeler olduğunda burada gösterilecektir.

source: Updating {name}
de_de: Update von {name}
ja_jp: {name}をアップデートしています
pt_br: Atualizando {name}
ru_ru: {name} обновляется
tr_tr: {name} güncelleniyor

source: Use lifecycle hooks
de_de: Lebenszyklus-Hooks verwenden
ja_jp: ライフサイクルフックを使用
pt_br: Usar ganchos de ciclo de vida
ru_ru: Использовать хуки жизненного цикла
tr_tr: Yaşam döngüsü kancalarını kullanın

source: Use MetaMask Beyond Ethereum
de_de: MetaMask über Ethereum hinaus verwenden
ja_jp: イーサリアム以外でMetaMaskを使用
pt_br: Use a MetaMask para além do Ethereum
ru_ru: Использовать MetaMask за пределами Ethereum
tr_tr: Ethereum Ötesinde MetaMask Kullanın

source: Version
ja_jp: バージョン
pt_br: Versão
ru_ru: Версия
tr_tr: Sürüm

source: Version {0} update available
de_de: Version-{0}-Update verfügbar
ja_jp: バージョン{0}のアップデートが利用可能です
pt_br: Atualização para a versão {0} disponível
ru_ru: Доступно обновление версии {0}
tr_tr: Sürüm {0} güncellemesi mevcut

source: View
de_de: Anzeigen
ja_jp: 表示
pt_br: Ver
ru_ru: Просмотр
tr_tr: Görüntüle

source: View your preferred language
de_de: Ihre bevorzugte Sprache anzeigen
ja_jp: 言語設定を表示
pt_br: Ver seu idioma preferencial
ru_ru: Просмотр вашего предпочитаемого языка
tr_tr: Tercih ettiğiniz dili görüntüleyin

source: View your public key (Unknown network "m/{purpose}/{coinType}")
de_de: Ihren öffentlichen Schlüssel anzeigen (Unbekanntes Netzwerk „m/{purpose}/{coinType}“)
ja_jp: 公開鍵の表示 (不明なネットワーク "m/{purpose}/{coinType}")
pt_br: Ver sua chave pública (rede desconhecida "m/{purpose}/{coinType}")
ru_ru: Просмотр вашего открытого ключа (неизвестная сеть "m/{purpose}/{coinType}")
tr_tr: Genel anahtarınızı (Bilinmeyen ağ "m/{purpose}/{coinType}") görüntüleyin

source: View your public key for {name}
de_de: Ihren öffentlichen Schlüssel für {name} anzeigen
ja_jp: {name}の公開鍵を表示
pt_br: Ver sua chave pública para {name}
ru_ru: Просмотр вашего открытого ключа для {name}
tr_tr: {name} için genel anahtarınızı görüntüleyin

source: Warning
de_de: Ihren öffentlichen Schlüssel für {Name} anzeigen
ja_jp: 警告
pt_br: Aviso
ru_ru: Предупреждение
tr_tr: Uyarı

source: Website
ja_jp: Webサイト
pt_br: Site
ru_ru: Веб-сайт
tr_tr: Web Sitesi

source: You acknowledge that any Snap that you install is a Third Party Service, unless otherwise identified, as defined in the <0>Consensys Terms of Use</0>. Your use of Third Party Services is governed by separate terms and conditions set forth by the Third Party Service provider. Consensys does not recommend the use of any Snap by any particular person for any particular reason. You access, rely upon or use the Third Party Service at your own risk. Consensys disclaims all responsibility and liability for any losses on account of your use of Third Party Services. Any information you share with Third Party Services will be collected directly by those Third Party Services in accordance with their privacy policies. Please refer to their privacy policies for more information. Consensys has no access to information you share with Third Party Services.
de_de: Sie erkennen an, dass jeder Snap, den Sie installieren, eine Drittanbieter-Dienstleistung ist, sofern nicht anders angegeben, wie in den <0>Consensys-Nutzungsbedingungen</0> definiert. Ihre Nutzung von Drittanbieter-Dienstleistungen unterliegt separaten Bedingungen, die von Drittanbietern von Dienstleistungen festgelegt werden. Consensys empfiehlt nicht die Nutzung eines Snaps durch eine bestimmte Person aus einem bestimmten Grund. Sie greifen auf die Drittanbieter-Dienstleistung zu, verlassen sich darauf oder nutzen sie auf eigenes Risiko. Consensys lehnt jede Verantwortung und Haftung für Verluste ab, die sich aus Ihrer Nutzung von Drittanbieter-Dienstleistungen ergeben. Alle Informationen, die Sie den Drittanbieter-Dienstleistungen zur Verfügung stellen, werden direkt von diesen Drittanbieter-Dienstleistungen in Übereinstimmung mit deren Datenschutzrichtlinien erfasst. Weitere Informationen finden Sie in den jeweiligen Datenschutzrichtlinien. Consensys hat keinen Zugriff auf die Informationen, die Sie mit den Drittanbieter-Dienstleistungen teilen.
ja_jp: ユーザーは、別途特定されていない限り、インストールするSnapが<0>Consensys利用規約</0>で定義されているサードパーティサービスであることを認めたものとみなされます。サードパーティサービスの使用には、当該サードパーティサービスプロバイダーにより定められた、別の諸条件が適用されます。Consensysは、特定の相手に対して、いかなる理由であっても、Snapの使用を推奨するものではありません。サードパーティサービスへのアクセスや依存、またはその使用は、ユーザーの自己責任となります。Consensysは、サードパーティサービスの使用によりアカウントで発生した損失について、一切責任および賠償責任を負いません。サードパーティサービスと共有する情報は、当該サードパーティサービスにより、それぞれのプライバシーポリシーに従い直接収集されます。詳細は、各サードパーティサービスのプライバシーポリシーをご覧ください。Consensysは、ユーザーがサードパーティと共有した情報に一切アクセスできません。
pt_br: Você reconhece que qualquer Snap instalado é um Serviço Terceirizado, a menos que identificado de outra forma, conforme definido nos <0>Termos de Uso da Consensys</0>. Seu uso dos Serviços Terceirizados é regido por termos e condições separados, estabelecidos pelo prestador do Serviço Terceirizado. A Consensys não faz recomendação de uso de nenhum Snap a nenhuma pessoa específica por qualquer motivo específico. Você acessa, confia ou usa o Serviço Terceirizado por sua conta e risco. A Consensys se isenta de toda e qualquer responsabilidade e obrigação por perdas relacionadas ao seu uso dos Serviços Terceirizados. Qualquer informação que você compartilhar com os Serviços Terceirizados será coletada diretamente pelos respectivos Serviços Terceirizados, de acordo com as políticas de privacidade pertinentes. Consulte mais informações nas respectivas políticas de privacidade. A Consensys não tem acesso às informações que você compartilha com Serviços Terceirizados.
ru_ru: Вы признаете, что любой Snap, который вы устанавливаете, является Сторонней службой, если не указано иное, как она определена в <0>Условиях использования Consensys</0>. Использование вами Сторонних служб регулируется отдельными положениями и условиями, изложенными Сторонним поставщиком услуг. Consensys не рекомендует использовать Snap каким-либо конкретному лицу по какой-либо конкретной причине. Вы получаете доступ к Сторонней службе, полагаетесь на нее или используете ее на свой страх и риск. Consensys отказывается от любой материальной и иной ответственности за любые убытки, связанные с использованием вами Сторонних служб. Любая информация, которой вы делитесь со Сторонними службами, будет собираться непосредственно этими Сторонними службами в соответствии с их политикой конфиденциальности. Обратитесь к их политике конфиденциальности для получения дополнительной информации. У Consensys нет доступа к информации, которую вы передаете Сторонним службам.
tr_tr: Yüklediğiniz her Snap'in, aksi belirtilmedikçe, <0>Consensys Kullanım Şartları</0> bölümünde tanımlanan şekilde Üçüncü Taraf Hizmet olduğunu kabul edersiniz. Üçüncü Taraf Hizmetlerini kullanımınız Üçüncü Taraf Hizmet sağlayıcısı tarafından belirtilen ayrı şart ve koşullar ile yönetilir. Consensys, herhangi bir Snap'in herhangi bir sebeple herhangi bir kişi tarafından kullanımını önermez. Üçüncü Taraf Hizmetine erişiminizin, güvenmenizin veya kullanımınızın riski size aittir. Consensys, Üçüncü Taraf Hizmetlerini kullanımınızla ilgili zararlara yönelik her türlü sorumluluk ve yükümlülüğü reddeder. Üçüncü Taraf Hizmetleri ile paylaştığınız tüm bilgiler, kendi gizlilik politikalarına göre doğrudan bu Üçüncü Taraf Hizmetleri tarafından toplanır. Daha fazla bilgi için lütfen onların gizlilik politikalarına bakın. Consensys'in Üçüncü Taraflarla paylaştığınız bilgilere hiçbir erişimi yoktur.

source: You will not be able to use your MetaMask Secret Recovery Phrase to recover accounts added through Account Management Snaps. If your account credentials are lost or compromised, MetaMask will not be able to help you. If the Snap or the associated dapp is hacked or ceases to function, you may not be able to access your account and the funds in your account.
de_de: Sie können Ihre geheime MetaMask-Wiederherstellungsphrase nicht verwenden, um Konten wiederherzustellen, die über Account-Management-Snaps hinzugefügt wurden. Wenn Ihre Kontoanmeldedaten verloren gehen oder kompromittiert werden, kann MetaMask Ihnen nicht helfen. Wenn der Snap oder die zugehörige DApp gehackt wird oder nicht mehr funktioniert, können Sie möglicherweise nicht mehr auf Ihr Konto und die Gelder auf Ihrem Konto zugreifen.
ja_jp: アカウント管理Snapにより追加されたアカウントは、MetaMaskのシークレットリカバリーフレーズを使用して復元できません。アカウントの認証情報をなくしたり盗まれたりした場合、MetaMaskはお役に立てません。SnapまたはコンパニオンDAppがハッキングされたり、それらの機能が停止したりした場合、アカウントやアカウントの資金にアクセスできなくなる可能性があります。
pt_br: Você não poderá usar sua Frase de Recuperação Secreta da MetaMask para recuperar contas adicionadas através de Snaps de gerenciamento de contas. Se suas credenciais de contas forem perdidas ou comprometidas, a MetaMask não poderá ajudar você. Se o Snap ou o dapp associado for hackeado ou parar de funcionar, talvez você não consiga acessar sua conta e os fundos nela.
ru_ru: Вы не сможете использовать свою секретную фразу для восстановления MetaMask с целью восстановления счетов, добавленных с помощью Account Management Snaps. Если учетные данные вашего счета утрачены или раскрыты, MetaMask не сможет вам помочь. Если Snap или связанное с ним децентрализованное приложение будут взломаны или перестанут функционировать, вы не сможете получить доступ к своему счету и средствам на нем.
tr_tr: Hesap Yönetimi Snap'leri ile eklenen hesapları kurtarmak için MetaMask Gizli Kurtarma İfadenizi kullanamazsınız. Hesap kimlik bilgileriniz kaybolur veya başkalarının eline geçerse MetaMask size yardımcı olamaz. Snap veya ilişkili merkeziyetsiz uygulama hack'lenirse veya çalışmayı durdurursa hesabınıza ve hesabınızdaki paraya erişim sağlayamayabilirsiniz.

source: Ethereum
ja_jp: イーサリアム
