Repository: MetaMask/snaps-directory
Catalog: src/locales/*/messages.po
Languages: de_de, ja_jp, pt_br, ru_ru, tr_tr

source: {0} on the MetaMask Snaps Directory
de_de: {0} im MetaMask Snaps Directory
ja_jp: MetaMask Snaps Directoryの{0}
pt_br: {0} no Diretório do MetaMask Snaps
ru_ru: {0} в Каталоге MetaMask Snaps
tr_tr: MetaMask Snaps Dizinindeki {0}

source: {name} is now ready to use.
de_de: {name} ist jetzt einsatzbereit.
ja_jp: {name}の使用準備ができました。
pt_br: {name} já está pronto para uso.
ru_ru: {name} теперь готов к использованию.
tr_tr: {name} artık kullanılmaya hazır.

source: {nameText} Snaps
ja_jp: {nameText} Snap
pt_br: Snaps {nameText}
tr_tr: {nameText} Snap'leri

source: {nameText} Snaps on the MetaMask Snaps Directory
de_de: {nameText}-Snaps im MetaMask Snaps Directory
ja_jp: MetaMask Snaps Directoryの{nameText} Snap
pt_br: Snaps {nameText} no Diretório do MetaMask Snaps
ru_ru: Snaps {nameText} в Каталоге MetaMask Snaps
tr_tr: MetaMask Snaps Dizinindeki {nameText} Snap'leri

source: ©{0} MetaMask. All rights reserved.
de_de: ©{0} MetaMask. Alle Rechte vorbehalten.
ja_jp: ©{0} MetaMask. 不許複製。
pt_br: ©{0} MetaMask. Todos os direitos reservados.
ru_ru: ©{0} MetaMask. Все права защищены.
tr_tr: ©{0} MetaMask. Tüm hakları saklıdır.

source: <0>{name}</0> uses code that isn't viewable by the public. Critical parts of the codebase were audited for security, but later versions of the code may not be. Make sure you trust <1>{0}</1> before installing and using <2>{name}</2>.
de_de: <0>{name}</0> verwendet Code, der nicht für die Öffentlichkeit einsehbar ist. Kritische Teile der Codebasis wurden auf Sicherheit geprüft, aber spätere Versionen des Codes möglicherweise nicht. Stellen Sie sicher, dass Sie <1>{0}</1> vertrauen, bevor Sie <2>{name}</2> installieren und verwenden.
ja_jp: <0>{name}</0>は一般に表示されないコードを使用します。コードベースの重要な部分はセキュリティ監査を受けていますが、後のバージョンのコードは監査を受けていない可能性があります。<2>{name}</2>をインストールして使用する前に、<1>{0}</1>が信頼できることを確認してください。
pt_br: <0>{name}</0> usa um código que não é visível pelo público. Partes críticas da base do código foram auditadas quanto à segurança, mas versões posteriores do código podem não ser. Certifique-se de que confia em <1>{0}</1> antes de instalar e usar <2>{name}</2>.
ru_ru: <0>{name}</0> использует код, который не доступен для свободного просмотра. Критические части базы кода были проверены на предмет безопасности, но более поздние версии кода могут не проверяться. Убедитесь, что вы доверяете <1>{0}</1>перед установкой и использованием <2>{name}</2>.
tr_tr: <0>{name}</0> herkes tarafından görüntülenemeyen kod kullanır. Kod tabanının kritik kısımları güvenlik amaçlı denetlenir ancak kodun sonraki sürümleri denetlenmeyebilir. <2>{name}</2> yüklemeden ve kullanmadan önce şuna güvendiğinizden emin olun: <1>{0}</1>.

source: About
de_de: Über
ja_jp: 情報
pt_br: Sobre
ru_ru: О
tr_tr: Hakkında

source: Access the Ethereum provider
de_de: Zugriff auf den Ethereum-Anbieter
ja_jp: イーサリアムプロバイダーへのアクセス
pt_br: Acesso ao provedor de Ethereum
ru_ru: Получите доступ к поставщику Ethereum
tr_tr: Ethereum sağlayıcısına erişim sağla

source: Access the internet
de_de: Zugriff auf das Internet
ja_jp: インターネットへのアクセス
pt_br: Acesso à internet
ru_ru: Войдите в Интернет
tr_tr: İnternete erişim sağla

source: Account Management
ja_jp: アカウント管理
pt_br: Gerenciamento de contas
ru_ru: «Управление счетами» (Account Management)
tr_tr: Hesap Yönetimi

source: Account Management Snaps are released as part of an experimental beta release. You agree that you will only use one of these Snaps if you understand how it functions and how to use it, and you have fully read and understand all risk warnings and other disclosures made available by the Third Party Service provider relating to use of their Snap. You agree that Consensys is not responsible for any injury that you incur as a result of your use of this Snap.
de_de: Account-Management-Snaps werden als Teil einer experimentellen Beta-Version veröffentlicht. Sie erklären sich damit einverstanden, einen dieser Snaps nur dann zu verwenden, wenn Sie verstehen, wie er funktioniert und wie er zu verwenden ist, und wenn Sie alle Risikowarnungen und andere Informationen, die der Drittdienstanbieter in Bezug auf die Verwendung seines Snaps zur Verfügung stellt, vollständig gelesen und verstanden haben. Sie erklären sich damit einverstanden, dass Consensys nicht für Verletzungen verantwortlich ist, die Ihnen durch die Nutzung dieses Snaps entstehen.
ja_jp: アカウント管理Snapは、試験運用ベータ版の一部としてリリースされています。ユーザーは、これらのSnapのいずれも、機能や使い方を理解し、Snapの使用に関連してサードパーティサービスプロバイダーより提供されたすべてのリスクに関する警告およびその他開示事項を完全に読み、理解した場合にのみ使用することに同意するものとします。ユーザーは、Snapの使用に起因するいかなる被害についても、Consensysが責任を負わないことに同意するものとします。
pt_br: Snaps de gerenciamento de contas são lançados como parte de uma versão beta experimental. Você concorda que só usará um desses Snaps se entende como ele funciona e como usá-lo. Você também confirma que leu e entendeu na íntegra todos os riscos e outras declarações disponibilizados pelo prestador do serviço terceirizado, relacionados ao uso do respectivo Snap. Você concorda que a Consensys não é responsável por nenhuma lesão em que você incorra como resultado do seu uso desse Snap.
ru_ru: Snaps под названием «Управление счетами» (Account Management) выпущены в рамках экспериментальной бета-версии. Вы соглашаетесь с тем, что будете использовать один из этих Snap только в том случае, если вы понимаете, как он функционирует и как его использовать. Вы также подтверждаете, что полностью прочитали и поняли все предупреждения о рисках и другие заявления о раскрытии информации, предоставленные Сторонним поставщиком услуг в отношении использования его Snap. Вы соглашаетесь с тем, что Consensys не несет ответственности за любой ущерб, которые вы понесете в результате использования вами этого Snap.
tr_tr: Hesap Yönetimi Snap'leri deneysel beta sürümünün bir parçası olarak piyasaya sürülür. Bu Snap'lerden birini sadece nasıl işlediğini ve nasıl kullanılacağını anlıyorsanız ve Snap'lerinin kullanımı ile ilgili olarak Üçüncü Taraf Hizmet Sağlayıcısı tarafından sunulan tüm risk uyarılarını ve diğer açıklamaları tam olarak okuyup anladıysanız kullanacağınızı kabul ederseniz. Consensys'in bu Snap'i kullanımınızın sonucunda yaşayacağınız zararlardan sorumlu olmadığını kabul edersiniz.

source: Add
de_de: Hinzufügen
ja_jp: 追加
pt_br: Adicionar
ru_ru: Добавить
tr_tr: Ekle

source: Add and control Ethereum accounts
de_de: Ethereum-Konten hinzufügen und kontrollieren
ja_jp: イーサリアムアカウントの追加と制御
pt_br: Adicionar e controlar contas Ethereum
ru_ru: Добавляйте счета Ethereum и управляйте ими
tr_tr: Ethereum hesaplarını ekle ve kontrol et

source: Add to MetaMask
de_de: Zu MetaMask hinzufügen
ja_jp: MetaMaskに追加
pt_br: Adicionar à MetaMask
ru_ru: Добавить в MetaMask
tr_tr: MetaMask'e ekle

source: Add user
de_de: Nutzer hinzufügen
ja_jp: ユーザーを追加
pt_br: Adicionar usuário
ru_ru: Добавить пользователя
tr_tr: Kullanıcı ekle

source: Adjust your search or display all available Snaps by clicking below.
de_de: Passen Sie Ihre Suche an oder lassen Sie sich alle verfügbaren Snaps anzeigen, indem Sie unten klicken.
ja_jp: 検索を調整するか、以下をクリックして利用可能なすべてのSnapを表示してください。
pt_br: Ajuste sua pesquisa ou exiba todos os Snaps disponíveis clicando abaixo.
ru_ru: Настройте свой поиск или отобразите все доступные Snaps, нажав ниже.
tr_tr: Aşağıya tıklayarak aramanızı ayarlayın ve kullanılabilir tüm Snap'leri görüntüleyin.

source: All
de_de: Alle
ja_jp: すべて
pt_br: Tudo
ru_ru: Все
tr_tr: Tümü

source: Allow {name} to access low-level execution environments via WebAssembly.
de_de: Erlauben Sie {name} den Zugriff auf Low-Level-Ausführungsumgebungen über WebAssembly.
ja_jp: {name}がWebAssemblyを介して低レベルの実行環境にアクセスすることを許可します。
pt_br: Permitir que {name} acesse ambientes de execução de baixo nível através do WebAssembly.
ru_ru: Разрешите {name} доступ к низкоуровневым средам исполнения через WebAssembly.
tr_tr: {name} adlı snap'in WebAssembly aracılığıyla düşük seviye yürütme ortamlarına erişmesine izin verin.

source: Allow {name} to access the internet. This can be used to both send and receive data with third-party servers.
de_de: Erlauben Sie {name} den Zugriff auf das Internet. Dies kann sowohl zum Senden als auch zum Empfangen von Daten mit Servern von Dritten verwendet werden.
ja_jp: {name}によるインターネットへのアクセスを許可します。これは、サードパーティサーバーとのデータの送受信に使用されます。
pt_br: Permitir que {name} acesse a internet. Isso pode ser usado tanto para enviar quanto para receber dados com servidores terceirizados.
ru_ru: Разрешите {name} доступ к Интернету. Его можно использовать как для отправки данных на сторонние серверы, так и получения данных с них.
tr_tr: {name} adlı snap'in internete erişmesine izin verin. Üçüncü taraf sunucuları ile hem veri göndermek hem de veri almak için kullanılabilir.

source: Allow {name} to add or remove Ethereum accounts, then transact and sign with these accounts.
de_de: Erlauben Sie {name}, Ethereum-Konten hinzuzufügen oder zu entfernen und dann mit diesen Konten Transaktionen durchzuführen und zu signieren.
ja_jp: {name}がイーサリアムアカウントを追加または削除し、これらのアカウントでトランザクションや署名を行うことを許可します。
pt_br: Permitir que {name} adicione ou remova contas Ethereum, depois transacione e assine com essas contas.
ru_ru: Разрешите {name} добавлять или удалять счета Ethereum, а затем совершать транзакции и подписывать их с использованием этих счетов.
tr_tr: {name} adlı snap'in Ethereum hesabı eklemesine veya kaldırmasına izin verin, ardından bu hesaplarla işlem ve imza gerçekleştirin.

source: Allow {name} to communicate with MetaMask directly, in order for it to read data from the blockchain and suggest messages and transactions.
de_de: Erlauben Sie {name}, direkt mit MetaMask zu kommunizieren, damit es Daten aus der Blockchain lesen und Nachrichten und Transaktionen vorschlagen kann.
ja_jp: {name}がブロックチェーンのデータを読み込みメッセージやトランザクションを提案するために、MetaMaskと直接通信することを許可します。
pt_br: Permitir que {name} se comunique diretamente com a MetaMask, a fim de que ele leia dados da blockchain e sugira mensagens e transações.
ru_ru: Разрешите {name} связываться с MetaMask напрямую, чтобы он мог считывать данные из блокчейна и предлагать сообщения и транзакции.
tr_tr: Blok zincirinden veri okuyabilmesi ve mesaj ile işlemleri önerebilmesi için {name} adlı snap'in doğrudan MetaMask ile iletişim kurmasına izin verin.

source: Allow {name} to decode signatures and show insights within the MetaMask UI. This can be used for anti-phishing and security solutions.
de_de: Erlauben Sie {name}, Signaturen zu entschlüsseln und Einblicke innerhalb der MetaMask-Benutzeroberfläche zu geben. Dies kann für Anti-Phishing- und Sicherheitslösungen verwendet werden.
ja_jp: {name}による署名のデコードと、MetaMask UI内でのインサイトの表示を許可します。これは、フィッシング対策やセキュリティソリューションに使用されます。
pt_br: Permitir que {name} decodifique assinaturas e exiba insights dentro da IU da MetaMask. Isso pode ser usado para soluções antiphishing e de segurança.
ru_ru: Разрешите {name} декодировать подписи и показывать аналитическую информацию в пользовательском интерфейсе MetaMask. Это можно использовать для защиты от фишинга и обеспечения безопасности.
tr_tr: {name} adlı snap'in imzaların şifresini çözmesine ve MetaMask Kullanıcı Arayüzü dahilinde içgörüleri göstermesine izin verin. Kimlik avından korunma ve güvenlik çözümleri için kullanılabilir.

source: Allow {name} to decode transactions and show insights within the MetaMask UI. This can be used for anti-phishing and security solutions.
de_de: Erlauben Sie {name}, Signaturen zu entschlüsseln und Einblicke innerhalb der MetaMask-Benutzeroberfläche zu geben. Dies kann für Anti-Phishing- und Sicherheitslösungen verwendet werden.
ja_jp: {name}によるトランザクションのデコードと、MetaMask UI内でのインサイトの表示を許可します。これは、フィッシング対策やセキュリティソリューションに使用されます。
pt_br: Permitir que {name} decodifique transações e exiba insights dentro da IU da MetaMask. Isso pode ser usado para soluções antiphishing e de segurança.
ru_ru: Разрешите {name} декодировать транзакции и показывать аналитическую информацию в пользовательском интерфейсе MetaMask. Это можно использовать для защиты от фишинга и обеспечения безопасности.
tr_tr: {name} adlı snap'in işlemlerin şifresini çözmesine ve MetaMask Kullanıcı Arayüzü dahilinde içgörüleri göstermesine izin verin. Kimlik avından korunma ve güvenlik çözümleri için kullanılabilir.

source: Allow {name} to derive arbitrary keys unique to {name}, without exposing them. These keys are separate from your MetaMask account(s) and not related to your private keys or Secret Recovery Phrase. Other snaps cannot access this information.
de_de: Erlauben Sie {name}, beliebige, für {name} eindeutige Schlüssel abzuleiten, ohne sie offenzulegen. Diese Schlüssel sind von Ihrem MetaMask-Konto/Ihren MetaMask-Konten getrennt und haben nichts mit Ihren privaten Schlüsseln oder Ihrer geheimen Wiederherstellungsphrase zu tun. Andere Snaps können nicht auf diese Informationen zugreifen.
ja_jp: {name}が、{name}固有の任意のキーを公開せずに導出することを許可します。これらのキーはMetaMaskアカウントとは切り離されており、秘密鍵やシークレットリカバリーフレーズとは関連性がありません。他のSnapはこの情報にアクセスできません。
pt_br: Permitir que {name} derive chaves arbitrárias únicas para {name}, sem as expor. Essas chaves são separadas das suas contas da MetaMask e não estão relacionadas às suas chaves privadas ou Frase de Recuperação Secreta. Outros Snaps não podem acessar essas informações.
ru_ru: Разрешите {name} извлекать произвольные ключи, уникальные для этого {name}, не раскрывая их. Эти ключи отделены от вашего(-их) счета(-ов) MetaMask и не связаны с вашими закрытыми ключами или секретной фразой для восстановления. Другие Snaps не могут получить доступ к этой информации.
tr_tr: {name} adlı snap'in, paylaşmadan, {name} adlı snap için özel rastgele anahtarlar türetmesine izin verin. Bu anahtarlar MetaMask hesap veya hesaplarınızdan ayrıdır ve özel anahtarlarınızla ya da Gizli Kurtarma İfadenizle bağlantılı değildir. Diğer snap'ler bu bilgilere erişemez.

source: Allow {name} to display MetaMask popups with custom text, input field, and buttons to approve or reject an action. Can be used to create e.g., alerts, confirmations, and opt-in flows for a Snap.
de_de: Erlauben Sie {name} die Anzeige von MetaMask-Popups mit benutzerdefiniertem Text, Eingabefeld und Schaltflächen zur Genehmigung oder Ablehnung einer Aktion. Sie können damit z. B. Warnungen, Bestätigungen und Opt-in-Flows für einen Snap erstellen.
ja_jp: {name}がカスタムテキスト、入力フィールド、アクションの承認・拒否ボタンを備えたMetaMaskポップアップを表示することを許可します。これは、Snapのアラート、承認、オプトインフローなどの作成に使用されます。
pt_br: Permitir que {name} exiba popups da MetaMask com texto personalizado, campo de entrada de texto e botões para aprovar ou rejeitar uma ação. Pode ser usado para criar, por exemplo, alertas, confirmações e fluxos de adesão para um Snap.
ru_ru: Разрешите {name} отображать всплывающие окна MetaMask с настраиваемым текстом, полем ввода и кнопками для одобрения или отклонения действия. Может использоваться для создания, например, оповещения, подтверждения и процедуры получения согласия для Snap.
tr_tr: {name} adlı snap'in bir eylemi onaylamak ya da reddetmek için özel metin, giriş alanı ve düğmelerle MetaMask açılır pencerelerini göstermesine izin verin. Bir Snap için ör. uyarı, onay ve talep edilen akış oluşturmak için kullanılabilir.

source: Allow {name} to display notifications within MetaMask. A short notification text can be triggered by a Snap for actionable or time-sensitive information.
de_de: Erlauben Sie {name}, Benachrichtigungen in MetaMask anzuzeigen. Ein kurzer Benachrichtigungstext kann durch einen Snap für handlungsrelevante oder zeitkritische Informationen ausgelöst werden.
ja_jp: {name}がMetaMask内に通知を表示することを許可します。Snapは、行動を促す情報や緊急性の高い情報に関する短い通知テキストをトリガーできます。
pt_br: Permitir que {name} exiba notificações dentro da MetaMask. Um pequeno texto de notificação pode ser acionado por um Snap para informações acionáveis ou sensíveis ao tempo.
ru_ru: Разрешите {name} отображать уведомления в MetaMask. Короткий текст уведомления может отображаться Snap для получения информации, требующей действий, или срочной информации.
tr_tr: {name} adlı snap'in MetaMask dahilinde bildirim göstermesine izin verin. Eyleme geçirilebilir ya da zamana duyarlı bilgiler için bir Snap tarafından kısa bir bildirim metni tetiklenebilir.

source: Allow {name} to fetch and display address and domain lookups in different parts of the MetaMask UI.
de_de: Erlauben Sie {name} das Abrufen und Anzeigen von Adress- und Domänenabfragen in verschiedenen Teilen der MetaMask-Benutzeroberfläche.
ja_jp: {name}がMetaMask UIのさまざまな部分でアドレスとドメイン検索の取得と表示を行うことを許可します。
pt_br: Permitir que {name} busque e exiba consultas de endereços e domínios em diferentes partes da IU da MetaMask.
ru_ru: Разрешите {name} получать и отображать результаты поиска адресов и доменов в разных частях пользовательского интерфейса MetaMask.
tr_tr: {name} adlı snap'in MetaMask Arayüzünün farklı kısımlarında adres ve alan aramalarını almasına ve göstermesine izin verin.

source: Allow {name} to manage accounts and assets on the requested network. These accounts are derived and backed up using your secret recovery phrase (without revealing it). With the power to derive keys, {name} can support a variety of blockchain protocols beyond Ethereum (EVMs).
de_de: Erlauben Sie {name} die Verwaltung von Konten und Assets im angeforderten Netzwerk. Diese Konten werden unter Verwendung Ihrer geheimen Wiederherstellungsphrase abgeleitet und gesichert (ohne diese preiszugeben). Mit der Fähigkeit, Schlüssel abzuleiten, kann {name} eine Vielzahl von Blockchain-Protokollen jenseits von Ethereum (EVMs) unterstützen.
ja_jp: {name}による要求されたネットワークでのアカウントおよび資産の管理を許可します。これらのアカウントはシークレットリカバリーフレーズを (公開せずに) 使用して導出およびバックアップされます。キーを導出できることで、{name}はイーサリアム (EVM) だけでなく、さまざまなブロックチェーンプロトコルをサポートできるようになります。
pt_br: Permitir que {name} gerencie contas e ativos na rede solicitada. Essas contas são derivadas e passam por backup por meio da sua Frase de Recuperação Secreta (sem a revelar). Com o poder de derivar chaves, {name} pode dar suporte a uma variedade de protocolos de blockchain além da Ethereum (EVMs).
ru_ru: Разрешите {name} управлять счетами и активами в запрошенной сети. Создание и резервное копирование этих счетов выполняется с использованием вашей секретной фразы для восстановления (без ее раскрытия). Благодаря возможности получения ключей {name} может поддерживать различные протоколы блокчейна, помимо Ethereum (EVM).
tr_tr: {name} adlı snap'in talep edilen ağ üzerinde hesap ve varlıkları yönetmesine izin verin. Bu hesaplar, gizli kurtarma ifadenizi kullanarak (açığa çıkarmadan) türetilir ve yedeklenir. {name}, anahtar türetme gücü ile Ethereum (EVM'ler) dışında çeşitli blok zinciri protokollerini destekleyebilir.

source: Allow {name} to perform actions that run periodically at fixed times, dates, or intervals. This can be used to trigger time-sensitive interactions or notifications.
de_de: Erlauben Sie {name}, Aktionen auszuführen, die periodisch zu festen Zeiten, Daten oder Intervallen ausgeführt werden. Dies kann verwendet werden, um zeitabhängige Interaktionen oder Benachrichtigungen auszulösen.
ja_jp: {name}が一定の時刻、日付、または間隔で定期的に実行されるアクションを実行することを許可します。これは、タイミングが重要なやり取りや通知のトリガーに使用されます。
pt_br: Permitir que {name} realize ações executadas periodicamente em horários, datas ou intervalos fixos. Isso pode ser usado para acionar interações ou notificações sensíveis ao tempo.
ru_ru: Разрешите {name} выполнять действия, которые выполняются периодически в фиксированное время, даты или интервалы. Его можно использовать для запуска срочных взаимодействий или отправки уведомлений.
tr_tr: {name} adlı snap'in sabit saat, tarih veya aralıklarda periyodik olarak çalışan eylemleri gerçekleştirmesine izin verin. Zamana duyarlı etkileşim ya da bildirimleri tetiklemek için kullanılabilir.

source: Allow {name} to see the origin (URI) of websites that suggest transactions. This can be used for anti-phishing and security solutions.
de_de: Erlauben Sie {name}, die Herkunft (URI) von Websites zu sehen, die Transaktionen vorschlagen. Dies kann für Anti-Phishing- und Sicherheitslösungen verwendet werden.
ja_jp: {name}が、トランザクションを提案するWebサイトの出所 (URI) を確認することを許可します。これは、フィッシング対策やセキュリティソリューションに使用されます。
pt_br: Permitir que {name} veja a origem (URI) dos sites que sugerem transações. Isso pode ser usado para soluções antiphishing e de segurança.
ru_ru: Разрешите {name} видеть происхождение (URI) веб-сайтов, предлагающих транзакции. Это можно использовать для защиты от фишинга и обеспечения безопасности.
tr_tr: {name} adlı snap'in işlem öneren web sitelerinin asıl adresini (URI) görmesine izin verin. Kimlik avından korunma ve güvenlik çözümleri için kullanılabilir.

source: Allow {name} to store, update, and retrieve data securely with encryption. Other Snaps cannot access this information.
de_de: Erlauben Sie {name}, Daten sicher und verschlüsselt zu speichern, zu aktualisieren und abzurufen. Andere Snaps können nicht auf diese Informationen zugreifen.
ja_jp: {name}が暗号化を使用して安全にデータを保管、更新、取得することを許可します。他のSnapはこの情報にアクセスできません。
pt_br: Permitir que {name} armazene, atualize e recupere dados de forma segura com criptografia. Outros Snaps não podem acessar essas informações.
ru_ru: Разрешите {name} безопасно хранить, обновлять и извлекать данные с помощью шифрования. Другие Snaps не могут получить доступ к этой информации.
tr_tr: {name} adlı snap'in şifreleme ile güvenli bir şekilde veri depolamasına, güncellemesine ve almasına izin verin. Diğer Snap'ler bu bilgilere erişemez.

source: Allow {name} to use lifecycle hooks to run code at specific times during its lifecycle.
de_de: Erlauben Sie {name}, Lebenszyklus-Hooks zu verwenden, um Code zu bestimmten Zeiten während seines Lebenszyklus auszuführen.
ja_jp: {name}がライフサイクルフックを使用して、ライフサイクルの特定のタイミングでコードを実行することを許可します。
pt_br: Permitir que {name} use ganchos de ciclo de vida para executar código em horários específicos durante seu ciclo de vida.
ru_ru: Разрешите {name} использовать обработчики жизненного цикла для запуска кода в определенное время в течение его жизненного цикла.
tr_tr: Bu yaşam döngüsü sırasında belirli zamanlarda kod çalıştırmak için {name} adlı snap'in yaşam döngüsü kancalarını kullanmasına izin verin.

source: Allow {name} to view your public keys (and addresses) for the requested network. This does not grant any control of accounts or assets.
de_de: Erlauben Sie {name}, Ihre öffentlichen Schlüssel (und Adressen) für das gewünschte Netzwerk einzusehen. Damit wird keine Kontrolle über Konten oder Assets gewährt.
ja_jp: {name}が、要求されたネットワークの公開鍵 (およびアドレス) を表示することを許可します。これは、アカウントや資産のコントロールを許可するものでは一切ありません。
pt_br: Permitir que {name} veja suas chaves públicas (e endereços) na rede selecionada. Isso não concede nenhum controle de contas ou ativos.
ru_ru: Разрешите {name} просматривать ваши открытые ключи (и адреса) для запрошенной сети. Это не дает никакого контроля над счетами или активами.
tr_tr: {name} adlı snap'in talep edilen ağ için genel anahtarları (ve adresleri) görüntülemesine izin verin. Bu eylem, herhangi bir şekilde hesapların ya da varlıkların kontrolünü vermez.

source: Allow {origin} to communicate with {name}
de_de: Erlauben Sie {origin}, mit {name} zu kommunizieren.
ja_jp: {origin}による{name}とのやり取りを許可します。
pt_br: Permitir que {origin} se comunique com {name}
ru_ru: Разрешите {origin} обмениваться данными с {name}
tr_tr: {origin} ile {name} iletişimine izin verin

source: Allow {origin} to send messages to {name} and receive a response from {name}.
de_de: Erlauben Sie {origin}, Nachrichten an {name} zu senden und eine Antwort von {name} zu erhalten.
ja_jp: {origin}による{name}へのメッセージの送信と{name}からの応答の受信を許可します。
pt_br: Permitir que {origin} envie mensagens para {name} e receba uma resposta de {name}.
ru_ru: Разрешите {origin} отправлять сообщения в адрес {name} и получать ответ от {name}.
tr_tr: {origin} için {name} adlı snap'e mesaj gönderme ve {name} adlı snap'ten yanıt alma izni verin.
