Repository: MetaMask/snaps-directory
Catalog: src/locales/*/messages.po
Languages: de_de, ja_jp, pt_br, ru_ru, tr_tr

source: Allow other Snaps to communicate directly with {name}
de_de: Erlauben Sie anderen Snaps, direkt mit {name} zu kommunizieren.
ja_jp: 他のSnapが{name}と直接やり取りできるようにします
pt_br: Permitir que outros Snaps se comuniquem diretamente com {name}
ru_ru: Разрешите другим Snaps напрямую взаимодействовать с {name}
tr_tr: Diğer Snap'lerin doğrudan {name} ile iletişime geçmesine izin verin

source: Allow other Snaps to send messages to {name} and receive a response from {name}.
de_de: Erlauben Sie anderen Snaps, Nachrichten an {name} zu senden und eine Antwort von {name} zu erhalten.
ja_jp: 他のSnapによる{name}へのメッセージの送信と{name}からの応答の受信を許可します。
pt_br: Permitir que outros Snaps enviem mensagens para {name} e recebam uma resposta de {name}.
ru_ru: Разрешите другим Snaps отправлять сообщения в адрес {name} и получать ответ от {name}.
tr_tr: Tüm diğer Snap'ler için {name} adlı snap'e mesaj gönderme ve {name} adlı snap'ten yanıt alma izni verin.

source: Allow requests for adding and controlling Ethereum accounts
de_de: Erlauben Sie Anfragen zum Hinzufügen und Kontrollieren von Ethereum-Konten.
ja_jp: イーサリアムアカウントの追加と制御の要求を許可する
pt_br: Permitir solicitações para adicionar e controlar contas Ethereum
ru_ru: Разрешите запросы на добавление и управление счетами Ethereum
tr_tr: Ethereum hesaplarını ekleme ve kontrol etme taleplerine izin verin

source: Allow the Snap to interact with {snapId}.
de_de: Erlauben Sie dem Snap, mit {snapId} zu interagieren.
ja_jp: Snapによる{snapId}とのやり取りを許可します。
pt_br: Permitir que o Snap interaja com {snapId}.
ru_ru: Разрешите Snap взаимодействовать с {snapId}.
tr_tr: Snap'in {snapId} ile etkileşimde bulunmasına izin verin.

source: Allow websites to communicate with {name}
de_de: Erlauben Sie Websites, mit {name} zu kommunizieren.
ja_jp: Webサイトによる{name}とのやり取りを許可する
pt_br: Permitir que sites se comuniquem com {name}
ru_ru: Разрешите веб-сайтам обмениваться данными с {name}
tr_tr: Web sitelerinin {name} ile iletişim kurmasına izin verin

source: Allow websites to send messages to website and receive a response from {name}.
de_de: Erlauben Sie Websites, Nachrichten an die Website zu senden und eine Antwort von {name} zu erhalten.
ja_jp: WebサイトによるWebサイトへのメッセージの送信と{name}からの応答の受信を許可します。
pt_br: Permitir que sites enviem mensagens para o site e recebam uma resposta de {name}.
ru_ru: Разрешите веб-сайтам отправлять сообщения на веб-сайт и получать ответ от {name}.
tr_tr: Web sitelerinin web sitesine mesaj göndermesine ve {name} adlı snap'ten yanıt almasına izin verin.

source: Alphabetical
de_de: Alphabetisch
ja_jp: アルファベット順
pt_br: Alfabética
ru_ru: По алфавиту
tr_tr: Alfabetik

source: Audit
ja_jp: 監査
pt_br: Auditoria
ru_ru: Аудит
tr_tr: Denetle

source: Available on desktop
de_de: Verfügbar auf Desktop
ja_jp: デスクトップで利用可能
pt_br: Disponível para desktop
ru_ru: Доступно на ПК
tr_tr: Masaüstünde kullanılabilir

source: Back
de_de: Zurück
ja_jp: 戻る
pt_br: Voltar
ru_ru: Назад
tr_tr: Geri

source: Browse your installed {nameText} Snaps on the MetaMask Snaps Directory
de_de: Durchsuchen Sie Ihre installierten {nameText} Snaps im MetaMask Snaps Directory.
ja_jp: MetaMask Snaps Directoryでインストールされた{nameText} Snapの閲覧
pt_br: Explore seus Snaps {nameText} instalados no Diretório do MetaMask Snaps
ru_ru: Просматривайте установленные Snaps {nameText} в Каталоге MetaMask Snaps
tr_tr: MetaMask Snaps Dizininde yüklü {nameText} Snap'lerinize göz atın

source: Browse your installed Snaps on the MetaMask Snaps Directory.
de_de: Durchsuchen Sie Ihre installierten Snaps im MetaMask Snaps Directory.
ja_jp: MetaMask Snaps DirectoryでインストールされたSnapを閲覧します。
pt_br: Explore seus Snaps instalados no Diretório do MetaMask Snaps.
ru_ru: Просматривайте установленные Snaps в Каталоге MetaMask Snaps.
tr_tr: MetaMask Snaps Dizininde yüklü Snap'lerinize göz atın.

source: Build your own Snap
de_de: Erstellen Sie Ihren eigenen Snap
ja_jp: 独自のSnapを開発
pt_br: Crie seu próprio Snap
ru_ru: Создайте собственный Snap
tr_tr: Kendi Snap'inizi kurun

source: Categories
de_de: Kategorien
ja_jp: カテゴリー
pt_br: Categorias
ru_ru: Категории
tr_tr: Kategoriler

source: Category
de_de: Kategorie
ja_jp: カテゴリー
pt_br: Categoria
ru_ru: Категория
tr_tr: Kategori

source: Check
de_de: Prüfen
ja_jp: 確認
pt_br: Verificar
ru_ru: Проверить
tr_tr: İncele

source: Clock
de_de: Uhr
ja_jp: 時計
pt_br: Relógio
ru_ru: Часы
tr_tr: Saat

source: Close
de_de: Schließen
ja_jp: 閉じる
pt_br: Fechar
ru_ru: Закрыть
tr_tr: Kapat

source: Communication
de_de: Kommunikation
ja_jp: コミュニケーション
pt_br: Comunicação
ru_ru: Коммуникация
tr_tr: İletişim

source: Connect to {snapId}
de_de: Verbinden Sie sich mit {snapId}.
ja_jp: {snapId}に接続
pt_br: Conectar-se ao {snapId}
ru_ru: Подключить к {snapId}
tr_tr: {snapId} adlı snap'e bağlan

source: Connect to non-Ethereum blockchains with MetaMask.
de_de: Verbinden Sie sich mit Nicht-Ethereum-Blockchains mit MetaMask.
ja_jp: MetaMaskでイーサリアム以外のブロックチェーンに接続します。
pt_br: Conecte-se a blockchains não Ethereum com a MetaMask.
ru_ru: Подключайтесь к блокчейнам, помимо Ethereum, с помощью MetaMask.
tr_tr: MetaMask ile Ethereum dışı blok zincirlere bağlanın.

source: Contact
de_de: Kontakt
ja_jp: 連絡先
pt_br: Contato
ru_ru: Контакты
tr_tr: İletişim

source: Contact Us
de_de: Kontaktieren Sie uns
ja_jp: お問い合わせ
pt_br: Fale conosco
ru_ru: Связаться с нами
tr_tr: Bize Ulaşın

source: Continue to <0>{name}</0>'s website to get started with this snap.
de_de: Gehen Sie auf die Website von <0>{name}</0>, um mit diesem Snap zu beginnen.
ja_jp: <0>{name}</0>のWebサイトに移動して、このSnapの使用を開始します。
pt_br: Prossiga para o site de <0>{name}</0> para começar com esse Snap.
ru_ru: Перейдите на веб-сайт <0>{name}</0>, чтобы начать работу с этим Snap.
tr_tr: Bu snap ile başlamak için <0>{name}</0> web sitesine devam edin.

source: Create an Ethereum Account
de_de: Erstellen Sie ein Ethereum-Konto.
ja_jp: イーサリアムアカウントを作成
pt_br: Criar uma conta Ethereum
ru_ru: Создать счет Ethereum
tr_tr: Bir Ethereum Hesabı oluştur

source: Customize your web3 experience with {0}.
de_de: Passen Sie Ihr web3 Erlebnis mit {0} an.
ja_jp: {0}でWeb3エクスペリエンスをカスタマイズしましょう。
pt_br: Personalize sua experiência na web3 com {0}.
ru_ru: Настройте свой интерфейс web3 с помощью {0}.
tr_tr: {0} ile web3 deneyiminizi kişiselleştirin.

source: Derive arbitrary keys unique to {name}
de_de: Leiten Sie beliebige, für {name} eindeutige Schlüssel ab.
ja_jp: {name}に固有の任意のキーを導出する
pt_br: Derivar chaves arbitrárias únicas para {name}
ru_ru: Извлечь произвольные ключи, уникальные для этого {name}
tr_tr: {name} için eşsiz rastgele anahtarlar türetin

source: Description by <0>{name}</0>
de_de: Beschreibung von <0>{name}</0>
ja_jp: <0>{name}</0>による説明
pt_br: Descrição por <0>{name}</0>
ru_ru: Описание по <0>{name}</0>
tr_tr: <0>{name}</0> açıklaması

source: Desktop only
de_de: Nur Desktop
ja_jp: デスクトップ専用
pt_br: Somente desktop
ru_ru: Только для ПК
tr_tr: Sadece masaüstü

source: Developer
de_de: Entwickler
ja_jp: 開発者
pt_br: Desenvolvedor
ru_ru: Разработчик
tr_tr: Geliştirici

source: Developer Docs
de_de: Entwickler-Dokumente
ja_jp: 開発者用ドキュメント
pt_br: Documentações para desenvolvedores
ru_ru: Документы разработчика
tr_tr: Geliştirici Belgeleri

source: Developers
de_de: Entwickler
ja_jp: 開発者
pt_br: Desenvolvedores
ru_ru: Разработчики
tr_tr: Geliştiriciler

source: Discover
de_de: Entdecken
ja_jp: ディスカバリ
pt_br: Descobrir
ru_ru: Ознакомление
tr_tr: Keşfet

source: Discover Snaps
de_de: Snaps entdecken
ja_jp: Snapのご紹介
pt_br: Descobrir Snaps
ru_ru: Откройте для себя Snaps
tr_tr: Snap'leri keşfedin

source: Display a custom screen
de_de: Einen benutzerdefinierten Bildschirm anzeigen
ja_jp: カスタム画面の表示
pt_br: Exibir uma tela personalizada
ru_ru: Показать пользовательский экран
tr_tr: Özel bir ekran göster

source: Display dialog windows in MetaMask
de_de: Dialogfenster in MetaMask anzeigen
ja_jp: MetaMaskでのダイアログウィンドウの表示
pt_br: Exibir janelas de diálogo na MetaMask
ru_ru: Отображать диалоговые окна в MetaMask
tr_tr: MetaMask'te iletişim kutusu pencerelerini göster

source: Document code
de_de: Dokumentcode
ja_jp: ドキュメントコード
pt_br: Código do documento
ru_ru: Код документа
tr_tr: Belge kodu

source: Documentation
de_de: Dokumentation
ja_jp: ドキュメンテーション
pt_br: Documentação
ru_ru: Документация
tr_tr: Belgeler

source: Download MetaMask
de_de: MetaMask herunterladen
ja_jp: MetaMaskをダウンロード
pt_br: Baixar MetaMask
ru_ru: Скачать MetaMask
tr_tr: MetaMask'i İndir

source: Dropdown
ja_jp: ドロップダウン
pt_br: Suspenso
ru_ru: Выпадающее меню
tr_tr: Açılır Menü

source: Enable dark mode
de_de: Dunkelmodus aktivieren
ja_jp: ダークモードを有効にする
pt_br: Ativar modo escuro
ru_ru: Включить темный режим
tr_tr: Karanlık modu etkinleştir

source: Enable light mode
de_de: Lichtmodus aktivieren
ja_jp: ライトモードを有効にする
pt_br: Ativar modo claro
ru_ru: Включить светлый режим
tr_tr: Aydınlık modu etkinleştir

source: Experimental Beta
de_de: Experimentelle Beta
ja_jp: 試験運用ベータ版
pt_br: Beta experimental
ru_ru: Экспериментальная бета-версия
tr_tr: Deneysel Beta

source: Explore
de_de: Erkunden
ja_jp: 閲覧
pt_br: Explorar
ru_ru: Обзор
tr_tr: Keşfet

source: Explore All Snaps
de_de: Alle Snaps entdecken
ja_jp: すべてのSnapsを閲覧
pt_br: Explorar todos os Snaps
ru_ru: Обзор всех Snaps
tr_tr: Tüm Snap'leri Keşfet

source: Explore community-built Snaps to customize your web3 experience via our official directory.
de_de: Entdecken Sie die von der Community erstellten Snaps, um Ihr web3-Erlebnis über unser offizielles Verzeichnis anzupassen.
ja_jp: MetaMaskの公式ディレクトリで、Web3のエクスペリエンスをカスタマイズする、コミュニティが開発したSnapをご覧ください。
pt_br: Explore Snaps desenvolvidos pela comunidade para personalizar sua experiência na web3 por meio do nosso diretório oficial.
ru_ru: Изучите Snaps, созданные сообществом, чтобы персонализировать работу с web3 с помощью нашего официального каталога.
tr_tr: Resmi dizinimiz aracılığıyla web3 deneyiminizi kişiselleştirmek için topluluk tarafından oluşturulmuş Snap'leri keşfedin.

source: Explore Snaps
de_de: Snaps entdecken
ja_jp: Snapを閲覧
pt_br: Explorar Snaps
ru_ru: Обзор Snaps
tr_tr: Snap'leri Keşfet

source: Explore the latest community-built Snaps to customize your web3 experience.
de_de: Entdecken Sie die neuesten von der Community erstellten Snaps, um Ihr web3-Erlebnis individuell zu gestalten.
ja_jp: Web3のエクスペリエンスをカスタマイズする、コミュニティが開発した最新のSnapをご覧ください。
pt_br: Explore os Snaps mais recentes desenvolvidos pela comunidade para personalizar sua experiência web3.
ru_ru: Изучите новейшие Snaps, созданные сообществом, чтобы персонализировать свою работу с web3.
tr_tr: Web3 deneyiminizi kişiselleştirmek için topluluk tarafından oluşturulmuş en yeni Snap'leri keşfedin.

source: Explore, install, and use community-built features in MetaMask
de_de: Erkunden, installieren und nutzen Sie die von der Community entwickelten Funktionen in MetaMask
ja_jp: MetaMaskでコミュニティが開発した機能を閲覧、インストール、使用する
pt_br: Explore, instale e use recursos desenvolvidos pela comunidade na MetaMask
ru_ru: Исследуйте, устанавливайте и используйте функции MetaMask, созданные сообществом
tr_tr: MetaMask'te topluluk tarafından oluşturulmuş özellikleri keşfedin, yükleyin ve kullanın

source: Explore, install, and use community-built features in MetaMask. <0>Learn more</0> and <1>FAQ</1>.
de_de: Erkunden, installieren und nutzen Sie die von der Community entwickelten Funktionen in MetaMask. <0>Mehr erfahren</0> und <1>FAQ</1>.
ja_jp: MetaMaskで、コミュニティが開発した機能を閲覧、インストール、使用しましょう。<0>詳細</0>と<1>よくある質問</1>をご覧ください。
pt_br: Explore, instale e use recursos desenvolvidos pela comunidade na MetaMask. <0>Saiba mais</0> e veja <1>perguntas frequentes</1>.
ru_ru: Изучайте, устанавливайте и используйте функции MetaMask, созданные сообществом. <0>Подробнее</0> и <1>Часто задаваемые вопросы</1>.
tr_tr: MetaMask'te topluluk tarafından oluşturulmuş özellikleri keşfedin, yükleyin ve kullanın. <0>Daha fazla bilgi alın</0> ve <1>SSS</1>.

source: External link
de_de: Externer Link
ja_jp: 外部リンク
pt_br: Link externo
ru_ru: Внешняя ссылка
tr_tr: Harici bağlantı

source: FAQ
ja_jp: よくある質問
pt_br: Perguntas frequentes
ru_ru: Часто задаваемые вопросы
tr_tr: SSS

source: Feedback
ja_jp: フィードバック
ru_ru: Отзыв
tr_tr: Geri Bildirim

source: Fetch and display signature insights
de_de: Einblicke in Signaturen abrufen und anzeigen
ja_jp: 署名分析情報の取得と表示
pt_br: Buscar e exibir insights de assinaturas
ru_ru: Получение и отображение подробных данных о подписях
tr_tr: İmza içgörülerini al ve görüntüle

source: Fetch and display transaction insights
de_de: Transaktionseinblicke abrufen und anzeigen
ja_jp: トランザクションインサイトの取得と表示
pt_br: Buscar e exibir insights de transações
ru_ru: Получение и отображение подробных данных о транзакциях
tr_tr: İşlem içgörülerini al ve görüntüle

source: Filter
ja_jp: フィルター
pt_br: Filtrar
ru_ru: Фильтр
tr_tr: Filtrele

source: Flash
ru_ru: Сброс
tr_tr: Flaş

source: Frequently asked questions
de_de: Häufig gestellte Fragen
ja_jp: よくある質問
pt_br: Perguntas frequentes
ru_ru: Часто задаваемые вопросы
tr_tr: Sıkça sorulan sorular

source: Get in touch
de_de: Kontakt aufnehmen
ja_jp: お問い合わせ
pt_br: Fale conosco
ru_ru: Связаться
tr_tr: İletişime geç

source: Global
ja_jp: グローバル
ru_ru: Глобальный
tr_tr: Küresel

source: Go home
de_de: Zur Startseite gehen
ja_jp: ホームに戻る
pt_br: Ir ao início
ru_ru: Перейти на главную
tr_tr: Ana sayfaya git

source: Got it
de_de: Verstanden
ja_jp: 了解
pt_br: Entendi
ru_ru: Понятно
tr_tr: Anladım

source: Guard Your Wallet
de_de: Schützen Sie Ihre Wallet
ja_jp: ウォレットの保護
pt_br: Proteja sua carteira
ru_ru: Защитите свой кошелек
tr_tr: Cüzdanınızı Koruyun

source: Guard your wallet with transaction insights and safety tools.
de_de: Schützen Sie Ihre Wallet mit Transaktionseinblicken und Sicherheitstools.
ja_jp: トランザクションインサイトや安全ツールでウォレットを守りましょう。
pt_br: Proteja sua carteira com insights de transações e ferramentas de segurança.
ru_ru: Защитите свой кошелек с помощью подробной информации о транзакциях и инструментов безопасности.
tr_tr: İşlem içgörüleri ve güvenlik araçları ile cüzdanınızı koruyun.

source: Hierarchy
de_de: Hierarchie
ja_jp: 階層
pt_br: Hierarquia
ru_ru: Иерархия
tr_tr: Hiyerarşi

source: Home
de_de: Startseite
ja_jp: ホーム
pt_br: Início
ru_ru: Главная
tr_tr: Ana Sayfa

source: Identifier
de_de: Kennung
ja_jp: 識別子
pt_br: Identificador
ru_ru: Идентификатор
tr_tr: Tanımlayıcı

source: Info
ja_jp: 情報
pt_br: Informações
ru_ru: Информация
tr_tr: Bilgi

source: Install MetaMask
de_de: MetaMask installieren
ja_jp: MetaMaskをインストール
pt_br: Instalar MetaMask
ru_ru: Установить MetaMask
tr_tr: MetaMask'i yükle

source: Installed
de_de: Installiert
ja_jp: インストール完了
pt_br: Instalado
ru_ru: Установлен
tr_tr: Yüklendi

source: Installed {nameText} Snaps
de_de: Installierte {nameText}-Snaps
ja_jp: インストールされた{nameText} Snap
pt_br: Snaps {nameText} instalados
ru_ru: Установленные Snaps {nameText}
tr_tr: Yüklü {nameText} Snap'leri

source: Installed {nameText} Snaps on the MetaMask Snaps Directory
de_de: Installierte {nameText}-Snaps im MetaMask Snaps Directory
ja_jp: MetaMask Snaps Directoryのインストールされた{nameText} Snap
pt_br: Snaps {nameText} instalados no Diretório do MetaMask Snaps
ru_ru: Установленные Snaps {nameText} в Каталоге MetaMask Snaps
tr_tr: MetaMask Snaps Dizininde yüklü {nameText} Snap'leri

source: Installed Snaps
de_de: Installierte Snaps
ja_jp: インストールされたSnap
pt_br: Snaps instalados
ru_ru: Установленные Snaps
tr_tr: Yüklü Snap'ler

source: Installed Snaps on the MetaMask Snaps Directory
de_de: Installierte Snaps im MetaMask Snaps Directory
ja_jp: MetaMask Snaps DirectoryのインストールされたSnap
pt_br: Snaps instalados no Diretório do MetaMask Snaps
ru_ru: Установленные Snaps в Каталоге MetaMask Snaps
tr_tr: MetaMask Snaps Dizininde yüklü Snap'ler

source: Installing {name}
de_de: Installation von {name}
ja_jp: {name}をインストールしています
pt_br: Instalando {name}
ru_ru: Выполняется установка {name}
tr_tr: {name} yükleniyor

source: Interoperability
de_de: Interoperabilität
pt_br: Interoperabilidade
ru_ru: Совместимость
tr_tr: Birlikte çalışabilirlik

source: Key
de_de: Schlüssel
ja_jp: キー
pt_br: Chave
ru_ru: Ключ
tr_tr: Anahtar

source: Key Recovery
de_de: Schlüsselwiederherstellung
ja_jp: キーの復元
pt_br: Recuperação de chave
ru_ru: Восстановление ключа
tr_tr: Anahtar Kurtarma

source: Knowledge Base
de_de: Wissensdatenbank
ja_jp: 知識ベース
pt_br: Base de conhecimento
ru_ru: База знаний
tr_tr: Bilgi Tabanı

source: Latest
de_de: Neueste
ja_jp: 最新
pt_br: Mais recentes
ru_ru: Новейшие
tr_tr: En Yeni

source: Latest Snaps
de_de: Neueste Snaps
ja_jp: 最新のSnap
pt_br: Snaps mais recentes
ru_ru: Новейшие Snaps
tr_tr: En Yeni Snap'ler

source: Latest Snaps on the MetaMask Snaps Directory
de_de: Neueste Snaps im MetaMask Snaps Directory
ja_jp: MetaMask Snaps Directoryの最新のSnap
pt_br: Snaps mais recentes no Diretório do MetaMask Snaps
ru_ru: Новейшие Snaps в Каталоге MetaMask Snaps
tr_tr: MetaMask Snaps Dizinindeki En Yeni Snap'ler

source: Legal
de_de: Rechtliches
ja_jp: 法的情報
pt_br: Jurídico
ru_ru: Юридическая информация
tr_tr: Hukuki

source: Let {name} access your preferred language from your MetaMask settings. This can be used to localize and display {name}'s content using your language.
de_de: Lassen Sie {name} auf Ihre bevorzugte Sprache über Ihre MetaMask-Einstellungen zugreifen. Damit können Sie den Inhalt von {name} in Ihrer Sprache lokalisieren und anzeigen.
ja_jp: {name}がMetaMaskの言語設定にアクセスできるようにします。これは、{name}のコンテンツをユーザーの言語にローカライズして表示するために使用されます。
pt_br: Permita que {name} acesse seu idioma preferencial nas suas configurações da MetaMask. Isso pode ser usado para traduzir e exibir conteúdo de {name} usando seu idioma.
ru_ru: Разрешите {name} получать доступ к предпочитаемому вами языку в настройках MetaMask. Его можно использовать для локализации и отображения содержимого {name} на вашем языке.
tr_tr: {name} adlı snap'in MetaMask ayarlarınızdan tercih ettiğiniz dile erişmesine izin verin. {name} içeriğini dilinizi kullanarak yerelleştirmek ve görüntülemek için bu özellik kullanılabilir.

source: Let {name} display a custom home screen in MetaMask. This can be used for user interfaces, configuration, and dashboards.
de_de: Lassen Sie {name} einen benutzerdefinierten Startbildschirm in MetaMask anzeigen. Dieser kann für Benutzeroberflächen, Konfiguration und Dashboards verwendet werden.
ja_jp: {name}がMetaMaskでカスタムホーム画面を表示することを許可します。これは、ユーザーインターフェース、構成、ダッシュボードに使用されます。
pt_br: Permita que {name} exiba uma tela inicial personalizada na MetaMask. Isso pode ser usado para interfaces de usuário, configurações e painéis.
ru_ru: Разрешите {name} отображать пользовательский главный экран в MetaMask. Эту функцию можно использовать для пользовательских интерфейсов, конфигурации и инфопанелей.
tr_tr: {name} adlı snap'in MetaMask'te özel bir ana sayfa ekranı göstermesine izin verin. Bu, kullanıcı arayüzleri, yapılandırma ve kontrol panelleri için kullanılabilir.

source: Let {name} receive requests to add or remove accounts, plus sign and transact on behalf of these accounts.
de_de: Lassen Sie {name} Anfragen zum Hinzufügen oder Entfernen von Konten empfangen und im Namen dieser signieren und Transaktionen durchführen.
ja_jp: {name}がアカウントの追加または削除のリクエストを受け取ることや、これらのアカウントの代理で署名やトランザクションを行うことを許可します。
pt_br: Permita que {name} receba solicitações para adicionar ou remover contas, além de assinar e transacionar em nome dessas contas.
ru_ru: Разрешите {name} получать запросы на добавление или удаление счетов, а также подписывать и совершать транзакции от имени этих счетов.
tr_tr: {name} adlı snap'in hesap ekleme ve kaldırma talepleri almasına ve ayrıca bu hesapların adına imza ve işlem gerçekleştirmesine izin verin.

source: Link
ja_jp: リンク
ru_ru: Ссылка
tr_tr: Bağlantı

source: Live
ja_jp: ライブ
pt_br: No ar
ru_ru: Выпущенная версия
tr_tr: Canlı

source: Manage {name} accounts
de_de: {name}-Konten verwalten
ja_jp: {name}アカウントの管理
pt_br: Gerenciar contas de {name}
ru_ru: Управление счетами {name}
tr_tr: {name} hesaplarını yönet

source: Manage accounts (Unknown network "m/{purpose}/{coinType}")
de_de: Konten verwalten (Unbekanntes Netzwerk "m/{purpose}/{coinType}")
ja_jp: アカウントの管理 (不明なネットワーク "m/{purpose}/{coinType}")
pt_br: Gerenciar contas (rede desconhecida "m/{purpose}/{coinType}")
ru_ru: Управление счетами (неизвестная сеть "m/{purpose}/{coinType}")
tr_tr: Hesapları yönet (Bilinmeyen ağ "m/{purpose}/{coinType}")

source: Manage accounts (Unknown network "m/44'/{coinType}'")
de_de: Konten verwalten (Unbekanntes Netzwerk „m/44'/{coinType}'“)
ja_jp: アカウントの管理 (不明なネットワーク "m/44'/{coinType}'")
pt_br: Gerenciar contas (rede desconhecida "m/44'/{coinType}'")
ru_ru: Управление счетами (неизвестная сеть "m/44'/{coinType}'")
tr_tr: Hesapları yönet (Bilinmeyen ağ "m/44'/{coinType}'")

source: Manage your accounts and keys with MetaMask.
de_de: Verwalten Sie Ihre Konten und Schlüssel mit MetaMask.
ja_jp: MetaMaskでアカウントとキーを管理します。
pt_br: Gerencie suas contas e chaves com a MetaMask.
ru_ru: Управляйте своими счетми и ключами с помощью MetaMask.
tr_tr: MetaMask ile hesaplarınızı ve anahtarlarını yönetin.

source: Messages
de_de: Nachrichten
ja_jp: メッセージ
pt_br: Mensagens
ru_ru: Сообщения
tr_tr: Mesajlar

source: MetaMask Snaps is in open beta and only supported via our extension clients on desktop such as <0>Brave</0>, <1>Chrome</1>, or <2>Firefox</2>.
de_de: MetaMask Snaps befindet sich in der Open Beta und wird nur über unsere Erweiterungsclients auf dem Desktop wie <0>Brave</0>, <1>Chrome</1> oder <2>Firefox</2> unterstützt.
ja_jp: MetaMask Snapはオープンベータで、<0>Brave</0>、<1>Chrome</1>、<2>Firefox</2>などのデスクトップ版の拡張機能クライアントでのみサポートされています。
pt_br: O MetaMask Snaps está em beta aberto e só é compatível através dos nossos clientes da extensão para desktop como <0>Brave</0>, <1>Chrome</1> ou <2>Firefox</2>.
ru_ru: MetaMask Snaps находится на стадии открытой бета-версии и поддерживается только через наши клиенты расширений для браузеров персональных компьютеров, таких как <0>Brave</0>, <1>Chrome</1> и <2>Firefox</2>.
tr_tr: MetaMask Snaps, açık beta durumundadır ve sadece <0>Brave</0>, <1>Chrome</1> veya <2>Firefox</2> gibi masaüstünde uzantı istemcilerimiz ile desteklenir.

source: Most Popular
de_de: Am beliebtesten
ja_jp: 最も人気
pt_br: Mais populares
ru_ru: Самые популярные
tr_tr: En Popüler

source: No Snaps found
de_de: Keine Snaps gefunden
ja_jp: Snapが見つかりませんでした
pt_br: Nenhum Snap encontrado
ru_ru: Snaps не найдены
tr_tr: Snap bulunamadı

source: No updates
de_de: Keine Updates
ja_jp: 更新はありません
pt_br: Nenhuma atualização
ru_ru: Нет обновлений
tr_tr: Güncelleme yok

source: Notification
de_de: Benachrichtigung
ja_jp: 通知
pt_br: Notificação
ru_ru: Уведомление
tr_tr: Bildirim

source: Notifications
de_de: Benachrichtigungen
ja_jp: 通知
pt_br: Notificações
ru_ru: Уведомления
tr_tr: Bildirimler

source: Notifications and Chat
de_de: Benachrichtigungen und Chat
ja_jp: 通知とチャット
pt_br: Notificações e chat
ru_ru: Уведомления и чат
tr_tr: Bildirimler ve Sohbet

source: Open
de_de: Öffnen
ja_jp: 開く
pt_br: Abrir
ru_ru: Открыть
tr_tr: Aç

source: Open Beta Live
de_de: Beta Live öffnen
ja_jp: オープンベータライブ
pt_br: Beta aberto no ar
ru_ru: Открыть выпущенную бета-версию
tr_tr: Beta Live'i Aç

source: Open filter menu
de_de: Filtemenü öffnen
ja_jp: フィルターメニューを開く
pt_br: Abrir menu de filtros
ru_ru: Открыть меню фильтров
tr_tr: Filtrele menüsünü aç

source: Open notifications menu
de_de: Benachrichtigungsmenü öffnen
ja_jp: 通知メニューを開く
pt_br: Abrir menu de notificações
ru_ru: Открыть меню уведомлений
tr_tr: Bildirimler menüsünü aç

source: Page not found
de_de: Seite nicht gefunden
ja_jp: ページが見つかりません
pt_br: Página não encontrada
ru_ru: Страница не найдена
tr_tr: Sayfa bulunamadı

source: Page not found on the MetaMask Snaps Directory
de_de: Seite im MetaMask Snaps Directory nicht gefunden
ja_jp: MetaMask Snaps Directoryでページが見つかりません
pt_br: Página não encontrada no Diretório do MetaMask Snaps
ru_ru: Страница Каталога Snaps MetaMask не найдена
tr_tr: MetaMask Snaps Dizininde sayfa bulunamadı
